espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/ti_simplelink_sdk/repo_cc13xx_cc26xx/source/ti/devices/cc13x1_cc26x1/inc/hw_fcfg1.h
// Field:  [15:8] HPOSC_T2
//
// Internal. Only to be used through TI provided API.
#define FCFG1_HPOSC_MEAS_2_HPOSC_T2_W                                        8
#define FCFG1_HPOSC_MEAS_2_HPOSC_T2_M                               0x0000FF00
#define FCFG1_HPOSC_MEAS_2_HPOSC_T2_S                                        8

// Field:   [7:0] HPOSC_DT2
//
// Internal. Only to be used through TI provided API.
#define FCFG1_HPOSC_MEAS_2_HPOSC_DT2_W                                       8
#define FCFG1_HPOSC_MEAS_2_HPOSC_DT2_M                              0x000000FF
#define FCFG1_HPOSC_MEAS_2_HPOSC_DT2_S                                       0

//*****************************************************************************
//
// Register: FCFG1_O_HPOSC_MEAS_1
//
//*****************************************************************************
// Field: [31:16] HPOSC_D1
//
// Internal. Only to be used through TI provided API.
#define FCFG1_HPOSC_MEAS_1_HPOSC_D1_W                                       16
#define FCFG1_HPOSC_MEAS_1_HPOSC_D1_M                               0xFFFF0000
#define FCFG1_HPOSC_MEAS_1_HPOSC_D1_S                                       16

// Field:  [15:8] HPOSC_T1
//
// Internal. Only to be used through TI provided API.
#define FCFG1_HPOSC_MEAS_1_HPOSC_T1_W                                        8
#define FCFG1_HPOSC_MEAS_1_HPOSC_T1_M                               0x0000FF00
#define FCFG1_HPOSC_MEAS_1_HPOSC_T1_S                                        8

// Field:   [7:0] HPOSC_DT1
//
// Internal. Only to be used through TI provided API.
#define FCFG1_HPOSC_MEAS_1_HPOSC_DT1_W                                       8
#define FCFG1_HPOSC_MEAS_1_HPOSC_DT1_M                              0x000000FF
#define FCFG1_HPOSC_MEAS_1_HPOSC_DT1_S                                       0

//*****************************************************************************
//
// Register: FCFG1_O_CONFIG_CC26_FE
//
//*****************************************************************************
// Field: [31:28] IFAMP_IB
//
// Internal. Only to be used through TI provided API.
#define FCFG1_CONFIG_CC26_FE_IFAMP_IB_W                                      4
#define FCFG1_CONFIG_CC26_FE_IFAMP_IB_M                             0xF0000000
#define FCFG1_CONFIG_CC26_FE_IFAMP_IB_S                                     28

// Field: [27:24] LNA_IB
//
// Internal. Only to be used through TI provided API.
#define FCFG1_CONFIG_CC26_FE_LNA_IB_W                                        4
#define FCFG1_CONFIG_CC26_FE_LNA_IB_M                               0x0F000000
#define FCFG1_CONFIG_CC26_FE_LNA_IB_S                                       24

// Field: [23:19] IFAMP_TRIM
//
// Internal. Only to be used through TI provided API.
#define FCFG1_CONFIG_CC26_FE_IFAMP_TRIM_W                                    5
#define FCFG1_CONFIG_CC26_FE_IFAMP_TRIM_M                           0x00F80000
#define FCFG1_CONFIG_CC26_FE_IFAMP_TRIM_S                                   19

// Field: [18:14] CTL_PA0_TRIM
//
// Internal. Only to be used through TI provided API.
#define FCFG1_CONFIG_CC26_FE_CTL_PA0_TRIM_W                                  5
#define FCFG1_CONFIG_CC26_FE_CTL_PA0_TRIM_M                         0x0007C000
#define FCFG1_CONFIG_CC26_FE_CTL_PA0_TRIM_S                                 14

// Field:    [13] PATRIMCOMPLETE_N
//
// Internal. Only to be used through TI provided API.
#define FCFG1_CONFIG_CC26_FE_PATRIMCOMPLETE_N                       0x00002000
#define FCFG1_CONFIG_CC26_FE_PATRIMCOMPLETE_N_BITN                          13
#define FCFG1_CONFIG_CC26_FE_PATRIMCOMPLETE_N_M                     0x00002000
#define FCFG1_CONFIG_CC26_FE_PATRIMCOMPLETE_N_S                             13

// Field:    [12] RSSITRIMCOMPLETE_N
//
// Internal. Only to be used through TI provided API.
#define FCFG1_CONFIG_CC26_FE_RSSITRIMCOMPLETE_N                     0x00001000
#define FCFG1_CONFIG_CC26_FE_RSSITRIMCOMPLETE_N_BITN                        12
#define FCFG1_CONFIG_CC26_FE_RSSITRIMCOMPLETE_N_M                   0x00001000
#define FCFG1_CONFIG_CC26_FE_RSSITRIMCOMPLETE_N_S                           12

// Field:   [7:0] RSSI_OFFSET
//
// Internal. Only to be used through TI provided API.
#define FCFG1_CONFIG_CC26_FE_RSSI_OFFSET_W                                   8
#define FCFG1_CONFIG_CC26_FE_RSSI_OFFSET_M                          0x000000FF
#define FCFG1_CONFIG_CC26_FE_RSSI_OFFSET_S                                   0

//*****************************************************************************
//
// Register: FCFG1_O_CONFIG_CC13_FE
//
//*****************************************************************************
// Field: [31:28] IFAMP_IB
//
// Internal. Only to be used through TI provided API.
#define FCFG1_CONFIG_CC13_FE_IFAMP_IB_W                                      4
#define FCFG1_CONFIG_CC13_FE_IFAMP_IB_M                             0xF0000000
#define FCFG1_CONFIG_CC13_FE_IFAMP_IB_S                                     28

// Field: [27:24] LNA_IB
//
// Internal. Only to be used through TI provided API.
#define FCFG1_CONFIG_CC13_FE_LNA_IB_W                                        4
#define FCFG1_CONFIG_CC13_FE_LNA_IB_M                               0x0F000000
#define FCFG1_CONFIG_CC13_FE_LNA_IB_S                                       24

// Field: [23:19] IFAMP_TRIM
//
// Internal. Only to be used through TI provided API.
#define FCFG1_CONFIG_CC13_FE_IFAMP_TRIM_W                                    5
#define FCFG1_CONFIG_CC13_FE_IFAMP_TRIM_M                           0x00F80000
#define FCFG1_CONFIG_CC13_FE_IFAMP_TRIM_S                                   19

// Field: [18:14] CTL_PA0_TRIM
//
// Internal. Only to be used through TI provided API.
#define FCFG1_CONFIG_CC13_FE_CTL_PA0_TRIM_W                                  5
#define FCFG1_CONFIG_CC13_FE_CTL_PA0_TRIM_M                         0x0007C000
#define FCFG1_CONFIG_CC13_FE_CTL_PA0_TRIM_S                                 14

