espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/ti_simplelink_sdk/repo_cc13xx_cc26xx/source/ti/devices/cc13x1_cc26x1/inc/hw_fcfg1.h
// Field:    [13] PATRIMCOMPLETE_N
//
// Internal. Only to be used through TI provided API.
#define FCFG1_CONFIG_CC13_FE_PATRIMCOMPLETE_N                       0x00002000
#define FCFG1_CONFIG_CC13_FE_PATRIMCOMPLETE_N_BITN                          13
#define FCFG1_CONFIG_CC13_FE_PATRIMCOMPLETE_N_M                     0x00002000
#define FCFG1_CONFIG_CC13_FE_PATRIMCOMPLETE_N_S                             13

// Field:    [12] RSSITRIMCOMPLETE_N
//
// Internal. Only to be used through TI provided API.
#define FCFG1_CONFIG_CC13_FE_RSSITRIMCOMPLETE_N                     0x00001000
#define FCFG1_CONFIG_CC13_FE_RSSITRIMCOMPLETE_N_BITN                        12
#define FCFG1_CONFIG_CC13_FE_RSSITRIMCOMPLETE_N_M                   0x00001000
#define FCFG1_CONFIG_CC13_FE_RSSITRIMCOMPLETE_N_S                           12

// Field:   [7:0] RSSI_OFFSET
//
// Internal. Only to be used through TI provided API.
#define FCFG1_CONFIG_CC13_FE_RSSI_OFFSET_W                                   8
#define FCFG1_CONFIG_CC13_FE_RSSI_OFFSET_M                          0x000000FF
#define FCFG1_CONFIG_CC13_FE_RSSI_OFFSET_S                                   0

//*****************************************************************************
//
// Register: FCFG1_O_CONFIG_RF_COMMON
//
//*****************************************************************************
// Field:    [31] DISABLE_CORNER_CAP
//
// Internal. Only to be used through TI provided API.
#define FCFG1_CONFIG_RF_COMMON_DISABLE_CORNER_CAP                   0x80000000
#define FCFG1_CONFIG_RF_COMMON_DISABLE_CORNER_CAP_BITN                      31
#define FCFG1_CONFIG_RF_COMMON_DISABLE_CORNER_CAP_M                 0x80000000
#define FCFG1_CONFIG_RF_COMMON_DISABLE_CORNER_CAP_S                         31

// Field: [30:25] SLDO_TRIM_OUTPUT
//
// Internal. Only to be used through TI provided API.
#define FCFG1_CONFIG_RF_COMMON_SLDO_TRIM_OUTPUT_W                            6
#define FCFG1_CONFIG_RF_COMMON_SLDO_TRIM_OUTPUT_M                   0x7E000000
#define FCFG1_CONFIG_RF_COMMON_SLDO_TRIM_OUTPUT_S                           25

// Field:    [21] PA20DBMTRIMCOMPLETE_N
//
// Internal. Only to be used through TI provided API.
#define FCFG1_CONFIG_RF_COMMON_PA20DBMTRIMCOMPLETE_N                0x00200000
#define FCFG1_CONFIG_RF_COMMON_PA20DBMTRIMCOMPLETE_N_BITN                   21
#define FCFG1_CONFIG_RF_COMMON_PA20DBMTRIMCOMPLETE_N_M              0x00200000
#define FCFG1_CONFIG_RF_COMMON_PA20DBMTRIMCOMPLETE_N_S                      21

// Field: [20:16] CTL_PA_20DBM_TRIM
//
// Internal. Only to be used through TI provided API.
#define FCFG1_CONFIG_RF_COMMON_CTL_PA_20DBM_TRIM_W                           5
#define FCFG1_CONFIG_RF_COMMON_CTL_PA_20DBM_TRIM_M                  0x001F0000
#define FCFG1_CONFIG_RF_COMMON_CTL_PA_20DBM_TRIM_S                          16

// Field:  [15:9] RFLDO_TRIM_OUTPUT
//
// Internal. Only to be used through TI provided API.
#define FCFG1_CONFIG_RF_COMMON_RFLDO_TRIM_OUTPUT_W                           7
#define FCFG1_CONFIG_RF_COMMON_RFLDO_TRIM_OUTPUT_M                  0x0000FE00
#define FCFG1_CONFIG_RF_COMMON_RFLDO_TRIM_OUTPUT_S                           9

// Field:   [8:6] QUANTCTLTHRES
//
// Internal. Only to be used through TI provided API.
#define FCFG1_CONFIG_RF_COMMON_QUANTCTLTHRES_W                               3
#define FCFG1_CONFIG_RF_COMMON_QUANTCTLTHRES_M                      0x000001C0
#define FCFG1_CONFIG_RF_COMMON_QUANTCTLTHRES_S                               6

// Field:   [5:0] DACTRIM
//
// Internal. Only to be used through TI provided API.
#define FCFG1_CONFIG_RF_COMMON_DACTRIM_W                                     6
#define FCFG1_CONFIG_RF_COMMON_DACTRIM_M                            0x0000003F
#define FCFG1_CONFIG_RF_COMMON_DACTRIM_S                                     0

//*****************************************************************************
//
// Register: FCFG1_O_CONFIG_SYNTH_DIV2_CC26_2G4
//
//*****************************************************************************
// Field: [31:28] MIN_ALLOWED_RTRIM
//
// Internal. Only to be used through TI provided API.
#define FCFG1_CONFIG_SYNTH_DIV2_CC26_2G4_MIN_ALLOWED_RTRIM_W                 4
#define FCFG1_CONFIG_SYNTH_DIV2_CC26_2G4_MIN_ALLOWED_RTRIM_M        0xF0000000
#define FCFG1_CONFIG_SYNTH_DIV2_CC26_2G4_MIN_ALLOWED_RTRIM_S                28

// Field: [27:12] RFC_MDM_DEMIQMC0
//
// Internal. Only to be used through TI provided API.
#define FCFG1_CONFIG_SYNTH_DIV2_CC26_2G4_RFC_MDM_DEMIQMC0_W                 16
#define FCFG1_CONFIG_SYNTH_DIV2_CC26_2G4_RFC_MDM_DEMIQMC0_M         0x0FFFF000
#define FCFG1_CONFIG_SYNTH_DIV2_CC26_2G4_RFC_MDM_DEMIQMC0_S                 12

// Field:  [11:6] LDOVCO_TRIM_OUTPUT
//
// Internal. Only to be used through TI provided API.
#define FCFG1_CONFIG_SYNTH_DIV2_CC26_2G4_LDOVCO_TRIM_OUTPUT_W                6
#define FCFG1_CONFIG_SYNTH_DIV2_CC26_2G4_LDOVCO_TRIM_OUTPUT_M       0x00000FC0
#define FCFG1_CONFIG_SYNTH_DIV2_CC26_2G4_LDOVCO_TRIM_OUTPUT_S                6

// Field:     [5] RFC_MDM_DEMIQMC0_TRIMCOMPLETE_N
//
// Internal. Only to be used through TI provided API.
#define FCFG1_CONFIG_SYNTH_DIV2_CC26_2G4_RFC_MDM_DEMIQMC0_TRIMCOMPLETE_N \
                                                                    0x00000020
#define FCFG1_CONFIG_SYNTH_DIV2_CC26_2G4_RFC_MDM_DEMIQMC0_TRIMCOMPLETE_N_BITN \
                                                                             5
#define FCFG1_CONFIG_SYNTH_DIV2_CC26_2G4_RFC_MDM_DEMIQMC0_TRIMCOMPLETE_N_M \
                                                                    0x00000020
#define FCFG1_CONFIG_SYNTH_DIV2_CC26_2G4_RFC_MDM_DEMIQMC0_TRIMCOMPLETE_N_S \
                                                                             5

//*****************************************************************************
//
// Register: FCFG1_O_CONFIG_SYNTH_DIV2_CC13_2G4
//
//*****************************************************************************
// Field: [31:28] MIN_ALLOWED_RTRIM
//
// Internal. Only to be used through TI provided API.
#define FCFG1_CONFIG_SYNTH_DIV2_CC13_2G4_MIN_ALLOWED_RTRIM_W                 4
#define FCFG1_CONFIG_SYNTH_DIV2_CC13_2G4_MIN_ALLOWED_RTRIM_M        0xF0000000
#define FCFG1_CONFIG_SYNTH_DIV2_CC13_2G4_MIN_ALLOWED_RTRIM_S                28

// Field: [27:12] RFC_MDM_DEMIQMC0
//
// Internal. Only to be used through TI provided API.
#define FCFG1_CONFIG_SYNTH_DIV2_CC13_2G4_RFC_MDM_DEMIQMC0_W                 16
#define FCFG1_CONFIG_SYNTH_DIV2_CC13_2G4_RFC_MDM_DEMIQMC0_M         0x0FFFF000
#define FCFG1_CONFIG_SYNTH_DIV2_CC13_2G4_RFC_MDM_DEMIQMC0_S                 12

