espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/ti_simplelink_sdk/repo_cc13xx_cc26xx/source/ti/devices/cc13x1_cc26x1/inc/hw_fcfg1.h
// Field: [21:20] DBLR_LOOP_FILTER_RESET_VOLTAGE
//
// Internal. Only to be used through TI provided API.
#define FCFG1_MISC_OTP_DATA_1_DBLR_LOOP_FILTER_RESET_VOLTAGE_W               2
#define FCFG1_MISC_OTP_DATA_1_DBLR_LOOP_FILTER_RESET_VOLTAGE_M      0x00300000
#define FCFG1_MISC_OTP_DATA_1_DBLR_LOOP_FILTER_RESET_VOLTAGE_S              20

// Field: [19:10] HPM_IBIAS_WAIT_CNT
//
// Internal. Only to be used through TI provided API.
#define FCFG1_MISC_OTP_DATA_1_HPM_IBIAS_WAIT_CNT_W                          10
#define FCFG1_MISC_OTP_DATA_1_HPM_IBIAS_WAIT_CNT_M                  0x000FFC00
#define FCFG1_MISC_OTP_DATA_1_HPM_IBIAS_WAIT_CNT_S                          10

// Field:   [9:4] LPM_IBIAS_WAIT_CNT
//
// Internal. Only to be used through TI provided API.
#define FCFG1_MISC_OTP_DATA_1_LPM_IBIAS_WAIT_CNT_W                           6
#define FCFG1_MISC_OTP_DATA_1_LPM_IBIAS_WAIT_CNT_M                  0x000003F0
#define FCFG1_MISC_OTP_DATA_1_LPM_IBIAS_WAIT_CNT_S                           4

// Field:   [3:0] IDAC_STEP
//
// Internal. Only to be used through TI provided API.
#define FCFG1_MISC_OTP_DATA_1_IDAC_STEP_W                                    4
#define FCFG1_MISC_OTP_DATA_1_IDAC_STEP_M                           0x0000000F
#define FCFG1_MISC_OTP_DATA_1_IDAC_STEP_S                                    0

//*****************************************************************************
//
// Register: FCFG1_O_SHDW_DIE_ID_0
//
//*****************************************************************************
// Field:  [31:0] ID_31_0
//
// Shadow of DIE_ID_0 register in eFuse row number 5
#define FCFG1_SHDW_DIE_ID_0_ID_31_0_W                                       32
#define FCFG1_SHDW_DIE_ID_0_ID_31_0_M                               0xFFFFFFFF
#define FCFG1_SHDW_DIE_ID_0_ID_31_0_S                                        0

//*****************************************************************************
//
// Register: FCFG1_O_SHDW_DIE_ID_1
//
//*****************************************************************************
// Field:  [31:0] ID_63_32
//
// Shadow of DIE_ID_1 register in eFuse row number 6
#define FCFG1_SHDW_DIE_ID_1_ID_63_32_W                                      32
#define FCFG1_SHDW_DIE_ID_1_ID_63_32_M                              0xFFFFFFFF
#define FCFG1_SHDW_DIE_ID_1_ID_63_32_S                                       0

//*****************************************************************************
//
// Register: FCFG1_O_SHDW_DIE_ID_2
//
//*****************************************************************************
// Field:  [31:0] ID_95_64
//
// Shadow of DIE_ID_2 register in eFuse row number 7
#define FCFG1_SHDW_DIE_ID_2_ID_95_64_W                                      32
#define FCFG1_SHDW_DIE_ID_2_ID_95_64_M                              0xFFFFFFFF
#define FCFG1_SHDW_DIE_ID_2_ID_95_64_S                                       0

//*****************************************************************************
//
// Register: FCFG1_O_SHDW_DIE_ID_3
//
//*****************************************************************************
// Field:  [31:0] ID_127_96
//
// Shadow of DIE_ID_3 register in eFuse row number 8
#define FCFG1_SHDW_DIE_ID_3_ID_127_96_W                                     32
#define FCFG1_SHDW_DIE_ID_3_ID_127_96_M                             0xFFFFFFFF
#define FCFG1_SHDW_DIE_ID_3_ID_127_96_S                                      0

//*****************************************************************************
//
// Register: FCFG1_O_SHDW_OSC_BIAS_LDO_TRIM
//
//*****************************************************************************
// Field: [26:23] TRIMMAG
//
// Internal. Only to be used through TI provided API.
#define FCFG1_SHDW_OSC_BIAS_LDO_TRIM_TRIMMAG_W                               4
#define FCFG1_SHDW_OSC_BIAS_LDO_TRIM_TRIMMAG_M                      0x07800000
#define FCFG1_SHDW_OSC_BIAS_LDO_TRIM_TRIMMAG_S                              23

// Field: [22:18] TRIMIREF
//
// Internal. Only to be used through TI provided API.
#define FCFG1_SHDW_OSC_BIAS_LDO_TRIM_TRIMIREF_W                              5
#define FCFG1_SHDW_OSC_BIAS_LDO_TRIM_TRIMIREF_M                     0x007C0000
#define FCFG1_SHDW_OSC_BIAS_LDO_TRIM_TRIMIREF_S                             18

// Field: [17:16] ITRIM_DIG_LDO
//
// Internal. Only to be used through TI provided API.
#define FCFG1_SHDW_OSC_BIAS_LDO_TRIM_ITRIM_DIG_LDO_W                         2
#define FCFG1_SHDW_OSC_BIAS_LDO_TRIM_ITRIM_DIG_LDO_M                0x00030000
#define FCFG1_SHDW_OSC_BIAS_LDO_TRIM_ITRIM_DIG_LDO_S                        16

// Field: [15:12] VTRIM_DIG
//
// Internal. Only to be used through TI provided API.
#define FCFG1_SHDW_OSC_BIAS_LDO_TRIM_VTRIM_DIG_W                             4
#define FCFG1_SHDW_OSC_BIAS_LDO_TRIM_VTRIM_DIG_M                    0x0000F000
#define FCFG1_SHDW_OSC_BIAS_LDO_TRIM_VTRIM_DIG_S                            12

// Field:  [11:8] VTRIM_COARSE
//
// Internal. Only to be used through TI provided API.
#define FCFG1_SHDW_OSC_BIAS_LDO_TRIM_VTRIM_COARSE_W                          4
#define FCFG1_SHDW_OSC_BIAS_LDO_TRIM_VTRIM_COARSE_M                 0x00000F00
#define FCFG1_SHDW_OSC_BIAS_LDO_TRIM_VTRIM_COARSE_S                          8

// Field:   [7:0] RCOSCHF_CTRIM
//
// Internal. Only to be used through TI provided API.
#define FCFG1_SHDW_OSC_BIAS_LDO_TRIM_RCOSCHF_CTRIM_W                         8
#define FCFG1_SHDW_OSC_BIAS_LDO_TRIM_RCOSCHF_CTRIM_M                0x000000FF
#define FCFG1_SHDW_OSC_BIAS_LDO_TRIM_RCOSCHF_CTRIM_S                         0

//*****************************************************************************
//
// Register: FCFG1_O_SHDW_ANA_TRIM
//
//*****************************************************************************
// Field:    [30] ALT_VDDR_TRIM
//
// Internal. Only to be used through TI provided API.
#define FCFG1_SHDW_ANA_TRIM_ALT_VDDR_TRIM                           0x40000000
#define FCFG1_SHDW_ANA_TRIM_ALT_VDDR_TRIM_BITN                              30
#define FCFG1_SHDW_ANA_TRIM_ALT_VDDR_TRIM_M                         0x40000000
#define FCFG1_SHDW_ANA_TRIM_ALT_VDDR_TRIM_S                                 30

// Field:    [29] DET_LOGIC_DIS
//
// Internal. Only to be used through TI provided API.
#define FCFG1_SHDW_ANA_TRIM_DET_LOGIC_DIS                           0x20000000
#define FCFG1_SHDW_ANA_TRIM_DET_LOGIC_DIS_BITN                              29
#define FCFG1_SHDW_ANA_TRIM_DET_LOGIC_DIS_M                         0x20000000
#define FCFG1_SHDW_ANA_TRIM_DET_LOGIC_DIS_S                                 29

